app/controllers/categorias_controller.rb

  def index
    @categorias = Categoria.all
---
SELECT "categorias".* FROM "categorias"

  def create
    @categoria = Categoria.new(categoria_params)

    respond_to do |format|
      if @categoria.save
---
INSERT INTO "categorias" ("nome", "super_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "Pao"], ["super_id", ""], ["created_at", "2016-05-02 22:28:34.806765"], ["updated_at", "2016-05-02 22:28:34.806765"]]

    def set_categoria
      @categoria = Categoria.find(params[:id])
---
SELECT  "categorias".* FROM "categorias" WHERE "categorias"."id" = ? LIMIT 1  [["id", nil]]