app/controllers/fabricantes_controller.rb

  def index
    @fabricantes = Fabricante.all
---
SELECT "fabricantes".* FROM "fabricantes"

  def create
    @fabricante = Fabricante.new(fabricante_params)

    respond_to do |format|
      if @fabricante.save
---
INSERT INTO "fabricantes" ("nome", "endereco", "numero", "cnpj", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Luiz"], ["endereco", "Rua zero"], ["numero", "400"], ["cnpj", "1111111111111"], ["created_at", "2016-04-11 23:40:02.807909"], ["updated_at", "2016-04-11 23:40:02.807909"]]

  def update
    respond_to do |format|
      if @fabricante.update(fabricante_params)
---
UPDATE "fabricantes" SET "nome" = ?, "endereco" = ?, "numero" = ?, "cnpj" = ?, "updated_at" = ? WHERE "fabricantes"."id" = ?  [["nome", "Luiz"], ["endereco", "Rua zero"], ["numero", "400"], ["cnpj", "1111111111111"], ["updated_at", "2016-04-11 23:40:02.865416"], ["id", 1]]

  def destroy
    @fabricante.destroy
---
DELETE FROM "fabricantes" WHERE "fabricantes"."id" = ?  [["id", 1]]

    def set_fabricante
      @fabricante = Fabricante.find(params[:id])
---
SELECT  "fabricantes".* FROM "fabricantes" WHERE "fabricantes"."id" = ? LIMIT 1  [["id", 1]]