app/controllers/produtos_controller.rb

SELECT "produtos".* FROM "produtos"
---
  def index
    @produtos = Produto.all

INSERT INTO "produtos" ("nome", "unidade", "quantidade", "fabricante_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Vaquinha"], ["unidade", "G"], ["quantidade", 100.0], ["fabricante_id", 1], ["created_at", "2016-04-12 00:04:42.835474"], ["updated_at", "2016-04-12 00:04:42.835474"]]
---
  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save

UPDATE "produtos" SET "nome" = ?, "unidade" = ?, "quantidade" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["nome", "Vaquinha"], ["unidade", "G"], ["quantidade", 100.0], ["updated_at", "2016-04-12 00:04:42.799524"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @produto.update(produto_params)

DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 1]]
---
  def destroy
    @produto.destroy

SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_produto
      @produto = Produto.find(params[:id])